package Day5;

/*1. Написать программу, которая будет приветствовать всех, кроме Даниила. т.е. вы вводите
имя, программа выдает “Привет, “ + введенное имя. До тех пор пока вы не ввели имя Даниил.

2. Для каждого введенного в консоль числа проверять кратно ли оно 5 или нет. Если
кратно,то выводить в консоль – кратное 5. Ограничить ввод 20 числами. (условие) и фигурные скобки. Пока условие равно  оператор %)

3. Сделать бота для выдачи кредита. Условие кредита – зарплата от 25000 в месяц и срок
кредита до 1 года, максимальная сумма выдачи 150.000 рублей. Или можете придумать своиусловия.
Главное собрать от юзера данные и обработать их.В итоге выдать – вам одобрен кредит или же вам отказано.

4. Пишем чатбота для устройства на работу. Вопросы придумайте сами и условия тоже. Для
примера вам нужно спросить кандидата о знаниях тех или иных технологий и опыте работы.
Если все подходит – вывести – вы приняты на работу, иначе – отказано.

5. В консоль вводят 10 чисел последовательно. Проверить что они являются арифметической
последовательностью. Выдать что это не последовательность сразу же, как только вводится
неверное число.

6. Пишем полноценного бота который имеет какое-то количество комманд и может выдать
какую-то информацию по ним. На любой ввод который не подпадает под команды выдаем
список возможных комманд с предложением – извините, но такой команды нет. Вот список
того, что вы можете узнать. Добавить команду выхода и при ее вводе выйти из программы.*/

public class Task3 {
}
